Центр_управления_производительностью_демо/src/Catalogs/СчетчикиПроизводительности/СчетчикиПроизводительности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СчетчикиПроизводительности</name>
  <attributes>
    <name>КодСчетчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НациональноеПредставление</name>
    <attributes>
      <name>Язык</name>
      <type>
        <types>CatalogRef.ЯзыкиОС</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеНациональное</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Центр_управления_производительностью_демо/src/Catalogs/СчетчикиПроизводительности/Forms/ФормаЭлемента/Module.bsl
&НаСервереБезКонтекста
Функция ЗаполнитьПоШаблонуНаСервере(КодСчетчика)
	Возврат Справочники.СчетчикиПроизводительности.ПолучитьШаблонСчетчика(КодСчетчика);
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоШаблону(Команда)
	ШаблонЭлемента = ЗаполнитьПоШаблонуНаСервере(Объект.КодСчетчика);
	
	Если ШаблонЭлемента <> Неопределено Тогда
		Объект.Наименование = ШаблонЭлемента["Наименование"];
		Объект.Описание = ШаблонЭлемента["Описание"];
		
		Объект.НациональноеПредставление.Очистить();
		Для Каждого ТекЯзык Из ШаблонЭлемента["Языки"] Цикл
			НовСтрока = Объект.НациональноеПредставление.Добавить();
			НовСтрока.Язык = ТекЯзык.Ключ;
			НовСтрока.НаименованиеНациональное = ТекЯзык.Значение;
		КонецЦикла;
		
		ЭтотОбъект.Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтотОбъект.Элементы.ФормаЗаполнитьПоШаблону.Видимость = Объект.Ссылка.Предопределенный;
КонецПроцедуры
